<link href="../css/cssInfo.css" rel="stylesheet" type="text/css">
<!-- BEGIN blk_sobre --><table width="100%" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr>
    <td height="25" align="center" valign="middle" class="textoPretoTitulo"><div align="center">{titulo}
    </div></td>
  </tr>
  <tr>
    <td height="25" align="center" valign="middle" class="textoInterna">
      <table width="90%" border="0" cellpadding="0" cellspacing="2" bgcolor="#FFFFFF">
        <!--DWLayoutTable-->
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC" class="textoInterna">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/> <span class="textoPretoTitulo">&Iacute;ndice</span>
          <label><a name="topo" id="topo"></a></label></td>
        </tr>
        <tr>
          <td width="30" height="20">&nbsp;</td>
          <td width="1078" align="left" valign="top" class="textoInterna"><p><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#objetivos" class="linkPreto">Objetivos</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#perfil_egresso" class="linkPreto">Perfil Profissional do Egresso<br />
              </a></span><img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#forma_egresso" class="linkPreto">Forma de Ingresso</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#regime_ensino" class="linkPreto">Regime de Ensino</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#organizacao_curricular" class="linkPreto">Organiza&ccedil;&atilde;o Curricular</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#flexibilidade_curricular" class="linkPreto">Flexibilidade Curricular</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#fluxograma_curricular" class="linkPreto">Fluxograma Curricular</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#avaliacao_aprendizagem" class="linkPreto">Avalia&ccedil;&atilde;o da Aprendizagem</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#aproveitamento" class="linkPreto">Aproveitamento Avalia&ccedil;&atilde;o das Compet&ecirc;ncias Adquiridas</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#atividades_complementares" class="linkPreto">Atividades Complementares</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#estagio_supervisionado" class="linkPreto">Est&aacute;gio Supervisionado</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#trabalho_diplomacao" class="linkPreto">Trabalho de Diploma&ccedil;&atilde;o</a></span><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo"><a href="#professores" class="linkPreto">Professores</a></span><br />
              <br />
            </p>          </td>
        </tr>
        <!--DWLayoutTable-->
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC" class="textoInterna">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/> <span class="textoPretoTitulo">Objetivos</span>
            <label><a name="objetivos" id="objetivos"></a></label></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><label class="textoTurista">
            <div align="justify"><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPreto"><strong>Objetivo Geral</strong></span><br />
              <br />
              <span class="textoPreto">O Curso de Tecnologia em Desenvolvimento de Sistemas   do CEFET-PR / Unidade de Corn&eacute;lio Proc&oacute;pio tem como objetivo geral a forma&ccedil;&atilde;o de   recursos humanos para a automa&ccedil;&atilde;o dos sistemas de informa&ccedil;&atilde;o das organiza&ccedil;&otilde;es,   com vistas a atender as necessidades do mercado de trabalho corrente. As   necessidades que podem ser atendidas abrangem principalmente o desenvolvimento,   implanta&ccedil;&atilde;o e gerenciamento de sistemas para uso em processos organizacionais,   passando pela infra-estrutura e manuten&ccedil;&atilde;o de sistemas, atendendo &agrave;s exig&ecirc;ncias   da Lei de Diretrizes e Base da Educa&ccedil;&atilde;o Nacional - Lei n.o 9.394/96, o Decreto   n.o 2.208/97, o Parecer n.o 436/01, e as Diretrizes Curriculares nacionais   Gerais para a Educa&ccedil;&atilde;o Profissional de N&iacute;vel Tecnol&oacute;gico - DCN, de 03/12/02. </span><br />
              <br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/>&nbsp;<span class="textoPreto"><strong>Objetivo Espec&iacute;fico</strong></span><br />
              <p align="justify" class="textoPreto">Em uma avalia&ccedil;&atilde;o das empresas (citadas por   Marques Cesara), os segmentos mais significativos do mercado de atua&ccedil;&atilde;o da   ind&uacute;stria de software no Paran&aacute; s&atilde;o: automa&ccedil;&atilde;o comercial, administra&ccedil;&atilde;o geral,   financeiro, p&aacute;ginas Web, automa&ccedil;&atilde;o de escrit&oacute;rio, contabilidade, gerenciamento   de banco de dados, inform&aacute;tica na educa&ccedil;&atilde;o, administra&ccedil;&atilde;o de servi&ccedil;os, com&eacute;rcio   eletr&ocirc;nico, comunica&ccedil;&atilde;o de dados, dentre outros. A classifica&ccedil;&atilde;o dos postos de   trabalho &eacute; dada por alguns &oacute;rg&atilde;os que reconhecem, nomeiam e codificam os t&iacute;tulos   e que tamb&eacute;m descrevem caracter&iacute;sticas das ocupa&ccedil;&otilde;es do mercado de trabalho   brasileiro. Segundo a Classifica&ccedil;&atilde;o Brasileira de Ocupa&ccedil;&otilde;es (CBO) existem   fam&iacute;lias de profissionais de inform&aacute;tica, das quais destaca-se posto de trabalho   e c&oacute;digo respectivamente: Engenheiro de aplicativos em computa&ccedil;&atilde;o (2122-05),   Administrador de banco de dados (2123-05), Administrador de sistemas   computacionais (2123-15), Analista de desenvolvimento de sistemas (2124-05),   Analista de suporte computacional (2124-20).<br />
                  <br />
                Ainda em ocupa&ccedil;&otilde;es de n&iacute;vel   t&eacute;cnico existe o desenvolvimento, projeto, implanta&ccedil;&atilde;o e realiza&ccedil;&atilde;o de   aplica&ccedil;&otilde;es de trabalho, a saber: Programador de internet (3171-05), Programador   de sistemas de informa&ccedil;&atilde;o (3171-10), Programador de multim&iacute;dia   (3171-20).<br />
                <br />
                De acordo com a hierarquia adotada pela Classifica&ccedil;&atilde;o Nacional   Atividade Econ&ocirc;mica (CNAE) existem v&aacute;rios n&iacute;veis de especifica&ccedil;&atilde;o que   representam os servi&ccedil;os da atividade de inform&aacute;tica. As classes representam   algumas atividades e respectivos c&oacute;digos listados a seguir:<br />
                <br />
                a)   Desenvolvimento e edi&ccedil;&atilde;o de softwares prontos para uso (7221-4).<br />
                b)   Desenvolvimento de software sob encomenda e outras consultorias em   software(7229-0)<br />
                c) Atividades de banco de dados e distribui&ccedil;&atilde;o on-line e   conte&uacute;do eletr&ocirc;nico (7240-0)<br />
                <br />
                Existem ainda alguns postos de trabalhos   identificados na regi&atilde;o, s&atilde;o eles: Diretor de Inform&aacute;tica, Gerente de   Desenvolvimento de Sistemas, Gerente de Processamento de Dados, Gerente de   Projetos de Sistemas, Gerente de Inform&aacute;tica, Coordenador de Projetos de   Sistemas, Desenvolvedor de Sistemas, Analista de Software, Analista de   Microinform&aacute;tica, Analista de Sistemas (Junior, Pleno, S&ecirc;nior), Analista de   Suporte T&eacute;cnico, Analista de Treinamento (Junior, Pleno ou S&ecirc;nior), Analista   Programador, Administrador de Banco de Dados, Administrador de Redes de   Computadores, Programador de Computador (Junior, Pleno ou S&ecirc;nior), Operador de   Computador (Junior, Pleno, S&ecirc;nior), Operador de Microcomputador.<br />
                <br />
                Como   atividade principal deste curso do CEFET-PR / Unidade de Corn&eacute;lio Proc&oacute;pio &eacute; o   desenvolvimento de sistemas, devido &agrave;s caracter&iacute;sticas pr&oacute;prias da regi&atilde;o esta   atividade requer profissionais que extrapolam caracter&iacute;sticas exclusivas   pertinentes ao desenvolvimento, mas que tamb&eacute;m tenham uma vis&atilde;o um tanto mais   ampla, atuando desde o apoio no planejamento e implanta&ccedil;&atilde;o da infraestrutura de   inform&aacute;tica, especifica&ccedil;&atilde;o, desenvolvimento, at&eacute; a integra&ccedil;&atilde;o e manuten&ccedil;&atilde;o de   sistemas pr&eacute;-existentes. <br />
                <br />
                Al&eacute;m da forma&ccedil;&atilde;o tecnol&oacute;gica, tamb&eacute;m o mercado   requer uma forma&ccedil;&atilde;o complementar e human&iacute;stica; desta forma os desenvolvimentos   das compet&ecirc;ncias abaixo s&atilde;o os objetivos espec&iacute;ficos do curso supracitado que   podem ser assim definidas:<br />
                <br />
                -Desenvolver sistemas de informa&ccedil;&atilde;o utilizando   t&eacute;cnicas e metodologias de desenvolvimento e ferramentas   associadas;<br />
                -Programar usando linguagens de programa&ccedil;&atilde;o;<br />
                -Integrar   sistemas de informa&ccedil;&atilde;o;<br />
                -Desenvolver sistemas de informa&ccedil;&atilde;o baseados na   Web;<br />
                -Apoiar o planejamento e gerenciamento da infraestrutura necess&aacute;ria para   sistemas de informa&ccedil;&atilde;o;<br />
                -Implantar e administrar sistemas de banco de   dados;<br />
                -Implantar e administrar sistemas de informa&ccedil;&atilde;o;<br />
                -Atuar de forma   empreendedora na gera&ccedil;&atilde;o de novas oportunidades de neg&oacute;cio e de   trabalho;<br />
                -Auxiliar pesquisa aplicada e desenvolvimento (P&amp;D) em sistemas   de informa&ccedil;&atilde;o<br />
                <br />
                Face ao exposto, entre as diversas fun&ccedil;&otilde;es e postos de   trabalho que o Tecn&oacute;logo em Desenvolvimento de Sistemas do CEFET-PR / Unidade de   Corn&eacute;lio Proc&oacute;pio pode exercer no mercado de trabalho, tendo sempre no   desenvolvimento de sistemas o foco principal, podem ser destacadas as   seguintes:<br />
                <br />
                - Desenvolvedor de Sistemas Aplicativos (CBO e CNAE)<br />
                -   Programador de Computador (CBO)<br />
                - Administrador de Banco de Dados (CBO e   CNAE)<br />
                - Desenvolvedor de Sistemas para a Web (CBO)<br />
                - Analista de Sistemas   (CBO e CNAE)<br />
              - Analista Programador (CBO)<br />
              <br />
              <a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a><br />
              <br />
              </p>
            </div>
          </label></td>
        </tr>
        
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC"><span class="textoInterna">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/> </span><span class="textoPretoTitulo">Perfil Profissional do Egresso
              <label></label>
          </span>
          <label><a name="perfil_egresso" id="perfil_egresso"></a></label></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><p align="justify" class="textoPreto" name="op_ppe"><br />
            O Curso de Tecnologia em   Desenvolvimento de Sistemas do CEFET-PR / Unidade de Corn&eacute;lio Proc&oacute;pio prov&ecirc; uma   forma&ccedil;&atilde;o que capacita o profissional para a automa&ccedil;&atilde;o dos sistemas de informa&ccedil;&atilde;o   das organiza&ccedil;&otilde;es, com vistas a atender as necessidades do mercado de trabalho   corrente. As necessidades que podem ser atendidas abrangem o desenvolvimento,   implanta&ccedil;&atilde;o e gerenciamento de sistemas e infra-estrutura para uso em processos   organizacionais, nas variadas necessidades expostas pelo mercado.<br />
              <br />
              O curso   deve prover uma forma&ccedil;&atilde;o que capacite o profissional para a solu&ccedil;&atilde;o de problemas   do mundo real, por meio da constru&ccedil;&atilde;o de modelos computacionais e de sua   implementa&ccedil;&atilde;o. &Eacute; dever do curso formar um profissional na &aacute;rea de inform&aacute;tica   que possua as seguintes caracter&iacute;sticas: </p>
            <p align="justify" class="textoPreto">* Conhecimento e dom&iacute;nio do processo de projeto para   construir a solu&ccedil;&atilde;o de problemas de base cient&iacute;fica;<br />
  * Modelar e especificar   problemas do mundo real, com uso de t&eacute;cnicas apresentadas no curso;<br />
  *   Implantar sistemas de computa&ccedil;&atilde;o;<br />
  * Validar e transmitir a solu&ccedil;&atilde;o de um   problema de forma efetiva e contextualizada ao problema original;<br />
  * Analisar   e assimilar sistemas t&eacute;cnicos, cient&iacute;ficos e administrativos transformando-os em   algoritmos eficientes e eficazes capazes, desta forma, de resolver os problemas   do dia-a-dia dos usu&aacute;rios;<br />
  * Capacidade para aplicar seus conhecimentos de   forma independente e inovadora, acompanhando a evolu&ccedil;&atilde;o do setor e contribuindo   na busca de solu&ccedil;&otilde;es nas diferentes &aacute;reas aplicadas;<br />
  * Forma&ccedil;&atilde;o human&iacute;stica   permitindo a compreens&atilde;o do mundo e da sociedade, uma forma&ccedil;&atilde;o de neg&oacute;cios,   permitindo uma vis&atilde;o din&acirc;mica organizacional e estimulando o trabalho em grupo,   desenvolvendo suas habilidades de comunica&ccedil;&atilde;o.</p>
            <p align="justify" class="textoPreto">O tecn&oacute;logo egresso deve ter condi&ccedil;&otilde;es de assumir um   papel de agente transformador do mercado, sendo capaz de analisar as linguagens   de computador e os c&oacute;digos de comunica&ccedil;&atilde;o entre o usu&aacute;rio e a m&aacute;quina, podendo   empreender ou assumir chefia ou a organiza&ccedil;&atilde;o de Centro de Processamento de   Dados (CPD) e, tamb&eacute;m, trabalhar em tarefas espec&iacute;ficas, como documenta&ccedil;&atilde;o de   sistemas e elabora&ccedil;&atilde;o de manuais, tendo como desafio provocar mudan&ccedil;as atrav&eacute;s   da agrega&ccedil;&atilde;o de novas tecnologias na solu&ccedil;&atilde;o dos problemas e propiciando novos   tipos de atividades, agregando:</p>
            <p align="justify" class="textoPreto">* Dom&iacute;nio de novas ferramentas e implementa&ccedil;&atilde;o de   sistemas visando melhores condi&ccedil;&otilde;es de trabalho e de vida;<br />
              * Conhecimento e   emprego de modelos associados ao uso de ferramentas do estado-da-arte;<br />
              *   Pesquisa visando novos conhecimentos e produtos;<br />
              * Uma vis&atilde;o human&iacute;stica   consistente e cr&iacute;tica do impacto de sua atua&ccedil;&atilde;o profissional na sociedade. </p>
          <p align="justify" class="textoPreto">O quadro a seguir indica as compet&ecirc;ncias profissionais   classificadas por postos de trabalho identificados na regi&atilde;o. O objetivo do   curso &eacute; o desenvolvimento dessas compet&ecirc;ncias. As compet&ecirc;ncias C, E, H e I n&atilde;o   correspondem a algum posto espec&iacute;fico, mas comp&otilde;em o perfil do Tecn&oacute;logo.<br />
              <br />
                <a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a><br />
            <br />
          </p>          </td>
        </tr>
        
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC"><span class="textoInterna">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;</span><span class="textoPretoTitulo">Forma de Ingresso<a name="forma_egresso" id="forma_egresso"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle" class="textoPreto"><div align="justify"><span class="textoPreto"><br />
            A forma de acesso aos Cursos Superiores de Tecnologia   do Sistema CEFET-PR &eacute; por processo seletivo, obedecendo ao disposto na   Constitui&ccedil;&atilde;o Federal, em seu Artigo 44: &quot;A educa&ccedil;&atilde;o superior abranger&aacute; os   seguintes cursos e programas: de gradua&ccedil;&atilde;o, abertos a candidatos que tenham   conclu&iacute;do o ensino m&eacute;dio ou equivalente e tenham sido classificados em processo   seletivo (vestibular)&quot;.<br />
              <br />
            As provas limitam-se aos conte&uacute;dos integrantes do   N&uacute;cleo Comum do Ensino M&eacute;dio e destinam-se a aferir a forma&ccedil;&atilde;o recebida pelo   candidato e sua aptid&atilde;o para estudos superiores. S&atilde;o realizadas 3 provas assim   agrupadas:<br />
              <br />
            - Portugu&ecirc;s, Reda&ccedil;&atilde;o, L&iacute;ngua Estrangeira Moderna e   Biologia;<br />
            - F&iacute;sica, Geografia e Qu&iacute;mica;<br />
            - Matem&aacute;tica e   Hist&oacute;ria.<br />
            <br />
            <a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a><br />
              <br />
          </span></div></td>
        </tr>
        
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC"><span class="textoInterna">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;</span><span class="textoPretoTitulo">Regime de Ensino<a name="regime_ensino" id="regime_ensino"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><p align="justify" class="textoPreto"><br />
            O Curso Superior de Tecnologia em Desenvolvimento de   Sistemas de Informa&ccedil;&atilde;o do CEFET-PR - Unidade de Corn&eacute;lio Proc&oacute;pio, ser&aacute; composto   por seis ( 06 ) Per&iacute;odos de um semestre letivo e trabalhado atrav&eacute;s de M&oacute;dulos   de Ensino, que propiciar&atilde;o quatro ( 03 ) Certifica&ccedil;&otilde;es de Qualifica&ccedil;&atilde;o   Profissional de N&iacute;vel Tecnol&oacute;gico conforme o disposto no artigo 5&ordm; da Resolu&ccedil;&atilde;o   CNE/CP3 de 18/12/2002. <br />
                <br />
            O Per&iacute;odo &eacute; o intervalo de tempo de um semestre   de 100 dias letivos de atividade de ensino, contendo 400h para que as Unidades   Curriculares do m&oacute;dulo de ensino possam ser trabalhadas a desenvolver   compet&ecirc;ncias.<br />
            <br />
            O M&oacute;dulo de Ensino &eacute; o conjunto de unidades curriculares em   que se desenvolver&atilde;o as compet&ecirc;ncias e avalia&ccedil;&otilde;es atrav&eacute;s de estrat&eacute;gias   pedag&oacute;gicas.<br />
          As Unidades Curriculares s&atilde;o o conjunto de habilidades que ser&atilde;o   desenvolvidas ao longo de um per&iacute;odo de um semestre letivo.<br />
          <br />
          <a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a><br />
          <br />
          </p></td>
        </tr>
        
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC"><span class="textoInterna">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;</span><span class="textoPretoTitulo">Organiza&ccedil;&atilde;o Curricular<a name="organizacao_curricular" id="organizacao_curricular"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><div align="justify"><br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/> <span class="textoPreto"><strong>Fundamenta&ccedil;&atilde;o Geral</strong></span><br />
              <br />
              <span class="textoPreto">A estrutura curricular dos Cursos Superiores de tecnologia   do CEFET-PR obedecem ao disposto na Lei n.o 9.394, de 20/12/96, no Decreto n.o   2.208, de 17/04/97, no Parecer n.o 436/01, de 02/04/01, na Resolu&ccedil;&atilde;o CNE/CP 3,   nas Diretrizes Curriculares Nacionais Gerais para a Educa&ccedil;&atilde;o Profissional de   N&iacute;vel Tecnol&oacute;gico - DCN, Parecer n.o 29/02, 03/12/02, e nas resolu&ccedil;&otilde;es   espec&iacute;ficas, para cada curso, expedidas pelos &oacute;rg&atilde;os competentes.<br />
              <br />
              A   estrutura curricular do Curso Superior de Tecnologia em Desenvolvimento de   Sistemas de Informa&ccedil;&atilde;o do CEFET-PR - Unidade de Corn&eacute;lio Proc&oacute;pio, tem sua   ess&ecirc;ncia referenciada na pesquisa de mercado identificando a demanda para a   qualifica&ccedil;&atilde;o profissional do Estado do Paran&aacute;.<br />
              <br />
              Para dar atendimento &agrave;   demanda do mercado de um profissional com um perfil diferenciado, n&atilde;o s&oacute; em   tecnologia, mas tamb&eacute;m voltado para o desenvolvimento social, a organiza&ccedil;&atilde;o do   Curso Superior de Tecnologia em Desenvolvimento de Sistemas de Informa&ccedil;&atilde;o   apresenta bases cient&iacute;ficas e de gest&atilde;o de n&iacute;vel superior dimensionadas e   direcionada a terminalidade da forma&ccedil;&atilde;o do tecn&oacute;logos</span><br />
            <br />
              <img src="../images/setaPreta.gif" width="3" height="5" align="absmiddle"/><span class="textoPreto"><strong> Organiza&ccedil;&atilde;o Curricular</strong></span><br />
            <br />
            <span class="textoPreto">Os objetivos, ementas e bibliografia das unidades   curriculares est&atilde;o descritos conforme a seguir.</span><br />
            <br />
            <span class="textoPreto">{disciplinas}</span><br />
            <br />
            <span class="textoPreto"><a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a></span><br />
            <br />
          </div></td>
        </tr>
        
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo">Flexibilidade Curricular<a name="flexibilidade_curricular" id="flexibilidade_curricular"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><div align="justify"><span class="textoPreto"><br />
            O fluxograma do Curso Superior de Tecnologia em Curso Superior de Tecnologia em   Desenvolvimento de Sistemas de Informa&ccedil;&atilde;o encontra-se organizado em seis   m&oacute;dulos, mais Est&aacute;gio Curricular, Atividades Complementares e Trabalho de   Diploma&ccedil;&atilde;o.<br />
              <br />
            Os m&oacute;dulos B&aacute;sico - 1 e B&aacute;sico - 2 s&atilde;o obrigat&oacute;rios para que   o estudante possa prosseguir nos seus estudos. Ap&oacute;s conclu&iacute;-los, ele ter&aacute; tr&ecirc;s   alternativas de percurso: M&oacute;dulo de Desenvolvimento Para a Web, M&oacute;dulo de   Programa&ccedil;&atilde;o e M&oacute;dulo Banco de Dados. Estes m&oacute;dulos oferecem, respectivamente, as   certifica&ccedil;&otilde;es parciais: Desenvolvedor para Web, Programador, e Auxiliar de   Administra&ccedil;&atilde;o de Banco de Dados.<br />
              <br />
            Ap&oacute;s a conclus&atilde;o do M&oacute;dulo B&aacute;sico o   aluno poder&aacute; realizar o Est&aacute;gio Curricular. Concomitantemente ao M&oacute;dulo Projeto   de Software o aluno poder&aacute; iniciar o Trabalho de Diploma&ccedil;&atilde;o. <br />
              <br />
            Durante   todo o curso caber&aacute; ao estudante participar des Atividades Complementares que   privilegiem a constru&ccedil;&atilde;o de comportamentos sociais, humanos e profissionais   adicionais &agrave;s atividades acad&ecirc;micas tradicionais, devendo integralizar 70   (setenta) pontos, no m&iacute;nimo, relativos &agrave; sua participa&ccedil;&atilde;o ao longo do Curso.   Esta atividade visa enriquecer o processo ensino-aprendizagem; complementar a   forma&ccedil;&atilde;o social, humana e profissional do estudante; desenvolver atividades de   cunho comunit&aacute;rio e de interesse coletivo; realizar atividades de assist&ecirc;ncia   acad&ecirc;mica e de inicia&ccedil;&atilde;o cient&iacute;fica e tecnol&oacute;gica; participar de atividades   esportivas, art&iacute;sticas e culturais, al&eacute;m de interc&acirc;mbios com institui&ccedil;&otilde;es   cong&ecirc;neres. As pontua&ccedil;&otilde;es e as demais regulamenta&ccedil;&otilde;es referentes &agrave;s Atividades   Complementares estar&atilde;o dispostos em regulamento pr&oacute;prio aprovado pelo Conselho   de Ensino do CEFET-PR.<br />
              <br />
            Ap&oacute;s cumprir todos os m&oacute;dulos, o Est&aacute;gio   Curricular, as Atividades Complementares e o Trabalho de Diploma&ccedil;&atilde;o, o estudante   obter&aacute; o diploma de gradua&ccedil;&atilde;o como Tecn&oacute;logo em Desenvolvimento de Sistemas de   Informa&ccedil;&atilde;o.<br />
              <br />
            Com rela&ccedil;&atilde;o &agrave;s unidades curriculares que comp&otilde;em cada m&oacute;dulo,   e em conformidade com par&aacute;grafo segundo, Art. 47, do Cap&iacute;tulo IV que trata da   Educa&ccedil;&atilde;o Superior, da Lei no 9.394, de 20 de dezembro de 1996, o aluno que   julgar possuir extraordin&aacute;rio conhecimento em disciplinas do curso, demonstrados   por meio de evid&ecirc;ncias objetivas, poder&aacute; ter abreviada a dura&ccedil;&atilde;o do mesmo   mediante requerimento e execu&ccedil;&atilde;o de exame de sufici&ecirc;ncia na unidade curricular   requerida, a ser aplicado por banca examinadora especial designada pela Ger&ecirc;ncia   de Ensino e Pesquisa.</span><br />
            <br />
            <span class="textoPreto"><a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a></span><br />
              <br />
          </div></td>
        </tr>
        
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo">Fluxograma Curricular<a name="fluxograma_curricular" id="fluxograma_curricular"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><p align="center" class="textoPreto"><strong><br />
            Curso superior de tecnologia em desenvolvimento de   sistemas de informa&ccedil;&atilde;o<br />
          fluxograma curricular aprovado pela comiss&atilde;o de   especialistas mec/semtec.</strong><br />
          <br />
          <img src="../images/figura02.gif" width="492" height="663" /><br />
          <br />
          </p>
            <p align="center" class="textoPreto"><strong>a. Distribui&ccedil;&atilde;o da Carga Hor&aacute;ria e Unidades   Curriculares por M&oacute;dulos</strong></p>
            <p align="left"><span class="textoPreto">Abaixo est&atilde;o especificadas as unidades curriculares   contidas em cada m&oacute;dulo, bem como a distribui&ccedil;&atilde;o da carga hor&aacute;ria semanal e   semestral, as quais est&atilde;o descritas em horas-rel&oacute;gio, conforme estabelece o   Parecer CNE/CES N&ordm; 575 de 04/04/2001.</span></p>
            <p align="center"><br />  
              <img src="../images/figura03.gif" width="558" height="510" /></p>
            <p align="center"><img src="../images/figura04.gif" width="558" height="486" /><br />
                <br />
                <img src="../images/figura05.gif" width="560" height="254" /><br />
                  <br />
            <img src="../images/figura06.gif" width="560" height="280" /></p>
            <p align="left"><br />
                <span class="textoPreto"><a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a></span><br />
              <br />
            </p></td>
        </tr>
        
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo">Avalia&ccedil;&atilde;o da Aprendizagem<a name="avaliacao_aprendizagem" id="avaliacao_aprendizagem"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><div align="justify"><span class="textoPreto"><br />
            Os crit&eacute;rios de avalia&ccedil;&atilde;o do rendimento do aluno est&atilde;o estabelecidos no   Regulamento da Organiza&ccedil;&atilde;o Did&aacute;tico-Pedag&oacute;gica dos Cursos Superiores de   Tecnologia do Sistema CEFET-PR, que abrange o seguinte:<br />
              <br />
            * <strong>Verifica&ccedil;&atilde;o de Freq&uuml;&ecirc;ncia:</strong> &eacute; obrigat&oacute;ria a presen&ccedil;a do discente   nos ambientes em que se desenvolve o processo ensino-aprendizagem, no m&iacute;nimo, em   75% (setenta e cinco por cento) em cada unidade curricular do M&oacute;dulo de Ensino   ou trabalho acad&ecirc;mico. No decorrer do processo ser&atilde;o disponibilizados mecanismos   para que o aluno possa construir gradativamente as compet&ecirc;ncias, para efeito de   verifica&ccedil;&atilde;o de freq&uuml;&ecirc;ncia n&atilde;o h&aacute; abono de faltas.<br />
            * <strong>Avalia&ccedil;&atilde;o de   Aproveitamento Acad&ecirc;mico:</strong> o discente ser&aacute; promovido no M&oacute;dulo ap&oacute;s ter   constru&iacute;do todas as compet&ecirc;ncias. A avalia&ccedil;&atilde;o &eacute; bastante flex&iacute;vel e composto por   um leque muito amplo de oportunidades. Assim, s&atilde;o propostas provas formais dos   tipos objetiva, dissertativa, oral e pr&aacute;tica. S&atilde;o tamb&eacute;m propostas elabora&ccedil;&otilde;es e   apresenta&ccedil;&otilde;es de relat&oacute;rios, projetos, palestras, semin&aacute;rios e outras din&acirc;micas   convenientes a cada conte&uacute;do que se procura explorar.<br />
            <br />
            Para cada um desses   itens e de outros que por ventura venham a compor o elenco de par&acirc;metros que   permitem avaliar o desempenho acad&ecirc;mico do educando, ser&aacute; atribu&iacute;do um grau   conceitual, de acordo com o &quot;REGULAMENTO DA ORGANIZA&Ccedil;&Atilde;O DID&Aacute;TICO-PEDAG&Oacute;GICA DOS   CURSOS SUPERIORES DE TECNOLOGIA DO CEFET-PR&quot; regulamentado pelo Conselho de   Ensino do CEFET-PR.<br />
            <br />
            <a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a><br />
            <br />
          </span></div></td>
        </tr>
        

        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo">Aproveitamento Avalia&ccedil;&atilde;o das Compet&ecirc;ncias   Adquiridas<a name="aproveitamento" id="aproveitamento"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle" class="textoPreto"><div align="justify"><br />
            De acordo com a LDB n.o 9.394, de 20/12/96, Artigo 41 e 47, Cap&iacute;tulo IV, do   parecer n.o 2.208/97, do parecer n.o 436/01 e do Parecer n.o 776/97, &quot;o aluno   que julgar possuir extraordin&aacute;rio conhecimento em determinada compet&ecirc;ncia,   atrav&eacute;s de evid&ecirc;ncia(s) objetiva(s) poder&aacute; ter abreviada a dura&ccedil;&atilde;o desta,   mediante execu&ccedil;&atilde;o de Exame de Sufici&ecirc;ncia, a ser aplicado por banca examinadora   especial, indicada pela coordena&ccedil;&atilde;o do curso&quot;.<br />
              <br />
              O que deve ser avaliado   para fins de prosseguimento de estudo &eacute; o efetivo desenvolvimento de   compet&ecirc;ncias previstas no perfil profissional de conclus&atilde;o do curso. No caso de   compet&ecirc;ncias adquiridas em outros cursos superiores, a solicita&ccedil;&atilde;o de   aproveitamento ser&aacute; objeto de detalhada an&aacute;lise dos programas desenvolvidos, &agrave;   luz do perfil profissional de conclus&atilde;o do curso (CNE/CP: 29/02).<br />
              <br />
          As   Diretrizes para os CST do CEFET-PR, o Regulamento da Organiza&ccedil;&atilde;o Did&aacute;tico   Pedag&oacute;gico dos CST do CEFET-PR, aprovados pelo Conselho Diretor do CEFET-PR -   CODIR, definem os procedimentos para o aproveitamento e avalia&ccedil;&atilde;o de   compet&ecirc;ncias adquiridas.<br />
          <br />
          <a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a><br />
          <br />
          </div></td>
        </tr>
        

        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo">Atividades Complementares<a name="atividades_complementares" id="atividades_complementares"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><p align="justify" class="textoPreto"><br />
            Regulamento das Atividades Complementares   dos Cursos Superiores de Tecnologia do CEFET-PR</p>
            <p align="justify" class="textoPreto">CAP&Iacute;TULO I - DAS FINALIDADES<br />
              <br />
              Art.   1&ordm;. As Atividades Complementares, s&atilde;o consideradas disciplinas dos curr&iacute;culos   dos Cursos Superiores de Tecnologia, sendo dispostas no Regulamento da   Organiza&ccedil;&atilde;o Did&aacute;tico-Pedag&oacute;gica dos referidos Cursos.<br />
&sect;1&ordm;. As Atividades   Complementares totalizam duas disciplinas, desenvolvidas, uma a cada ciclo,   sendo a primeira poss&iacute;vel de finaliza&ccedil;&atilde;o at&eacute; o 4&ordm;. Per&iacute;odo e a segunda, at&eacute; o   8&ordm;. Per&iacute;odo.<br />
&sect;2&ordm;. O aluno poder&aacute; escolher entre os 11 (onze) Grupos das   Atividades Complementares, constantes no Art. 9&ordm;. deste Regulamento , atividades   que privilegiem a complementa&ccedil;&atilde;o da forma&ccedil;&atilde;o social, humana e profissional e   enrique&ccedil;am seus conhecimentos, devendo atingir a pontua&ccedil;&atilde;o necess&aacute;ria para a   aprova&ccedil;&atilde;o na disciplina.<br />
Art. 2&ordm;. As Atividades Complementares t&ecirc;m a   finalidade de enriquecer o processo de ensino-aprendizagem privilegiando:<br />
I a   complementa&ccedil;&atilde;o da forma&ccedil;&atilde;o social, humana e profissional;<br />
atividades de cunho   comunit&aacute;rio e de interesse coletivo;<br />
atividades de assist&ecirc;ncia acad&ecirc;mica e de   inicia&ccedil;&atilde;o cient&iacute;fica e tecnol&oacute;gica; atividades esportivas e culturais, al&eacute;m de   interc&acirc;mbios com institui&ccedil;&otilde;es cong&ecirc;neres.</p>
            <p align="justify" class="textoPreto">CAP&Iacute;TULO II - DO LOCAL DE REALIZA&Ccedil;&Atilde;O <br />
              <br />
              Art.3&ordm;. As Atividades Complementares poder&atilde;o ser desenvolvidas no   pr&oacute;prio CEFET-PR, promovidas pelos Departamentos de Ensino e Coordena&ccedil;&otilde;es de   Curso, ou por empresas, institui&ccedil;&otilde;es p&uacute;blicas ou privadas, que propiciem a   complementa&ccedil;&atilde;o da forma&ccedil;&atilde;o do aluno, assegurando o alcance dos objetivos   previstos no Artigo 1&ordm;. deste Regulamento.</p>
            <p align="justify" class="textoPreto">CAPITULO III - DAS COMPET&Ecirc;NCIAS DA   ENTIDADE CONCEDENTE DE ATIVIDADES COMPLEMENTARES<br />
              <br />
              Art.4&ordm;. &Agrave; Entidade   Concedente de Atividades Complementares compete:<br />
              assegurar ao aluno todas as   condi&ccedil;&otilde;es necess&aacute;rias para a plena realiza&ccedil;&atilde;o de suas atividades;<br />
              fornecer   documenta&ccedil;&atilde;o comprobat&oacute;ria da participa&ccedil;&atilde;o efetiva do aluno especificando a   carga hor&aacute;ria, per&iacute;odo de execu&ccedil;&atilde;o e descrevendo a atividade.<br />
              <br />
              CAP&Iacute;TULO   IV</p>
            <p align="justify" class="textoPreto">DAS ATRIBUI&Ccedil;&Otilde;ES DOS ENVOLVIDOS NO PROCESSO DAS   ATIVIDADES COMPLEMENTARES</p>
            <p align="justify" class="textoPreto">SE&Ccedil;&Atilde;O I - DO COORDENADOR DO CURSO</p>
            <p align="justify" class="textoPreto">Art. 5&ordm;. Ao Coordenador de Curso compete:<br />
              Designar o   Orientador das Atividades Complementares;<br />
              Supervisionar o desenvolvimento das   Atividades Complementares;<br />
              Julgar a valida&ccedil;&atilde;o das atividades n&atilde;o previstas no   Regulamento da Organiza&ccedil;&atilde;o Did&aacute;tico-Pedag&oacute;gica dos Cursos Superiores de   Tecnologia do Sistema CEFET-PR e neste Regulamento.<br />
              <br />
              SE&Ccedil;&Atilde;O II - DO   RIENTADOR </p>
            <p align="justify" class="textoPreto">Art. 6&ordm;. Ao Orientador das Atividades Complementares   compete:<br />
  analisar as documenta&ccedil;&otilde;es das Atividades Complementares apresentadas   pelo aluno levando em considera&ccedil;&atilde;o os objetivos estabelecidos no Artigo 1&ordm;.   deste Regulamento;<br />
  avaliar e pontuar as Atividades Complementares   desenvolvidas pelo aluno, de acordo com os crit&eacute;rios estabelecidos neste   Regulamento, levando em considera&ccedil;&atilde;o a documenta&ccedil;&atilde;o apresentada pelo aluno, em   conson&acirc;ncia com o Coordenador de Curso;<br />
  orientar o aluno quanto &agrave; pontua&ccedil;&atilde;o   das Atividades Complementares;<br />
  fixar e divulgar datas e hor&aacute;rios, nos   ambientes da Coordena&ccedil;&atilde;o do Curso, para atendimento aos alunos e an&aacute;lise dos   documentos comprobat&oacute;rios;<br />
              controlar e registrar as atividades complementares   desenvolvidas pelo aluno, bem como os procedimentos administrativos inerentes a   essa atividade;<br />
              encaminhar semestralmente para o Setor de Registros Escolares   do CEFET-PR, at&eacute; a data de entrega da &uacute;ltima nota parcial, o resultado parcial   das pontua&ccedil;&otilde;es obtidas pelo aluno; <br />
              participar das reuni&otilde;es dos Orientadores   das Atividades Complementares.</p>
            <p align="justify" class="textoPreto">SE&Ccedil;&Atilde;O III - DO ALUNO</p>
            <p align="justify" class="textoPreto">Art. 7&ordm;. Ao aluno compete:<br />
              informar-se sobre as   atividades oferecidas dentro ou fora do CEFET-PR;<br />
              inscrever-se nos programas   e participar efetivamente destes;<br />
              providenciar a documenta&ccedil;&atilde;o que comprove a   sua participa&ccedil;&atilde;o;<br />
              apresentar ao Orientador das Atividades Complementares, at&eacute;   a data limite fixada pelo mesmo, a documenta&ccedil;&atilde;o comprobat&oacute;ria das atividades   realizadas;<br />
              acumular a pontua&ccedil;&atilde;o m&iacute;nima de 70 pontos, por ciclo, at&eacute; o 4&ordm; e   8&ordm; per&iacute;odos do Curso;<br />
              arquivar a documenta&ccedil;&atilde;o comprobat&oacute;ria das Atividades   Complementares e apresent&aacute;-la sempre que solicitado.<br />
              <br />
              CAP&Iacute;TULO V - DA   AVALIA&Ccedil;&Atilde;O DAS ATIVIDADES COMPLEMENTARES</p>
            <p align="justify" class="textoPreto">Art. 8&ordm;. Na avalia&ccedil;&atilde;o das Atividades Complementares   desenvolvidas pelo aluno, ser&atilde;o considerados:<br />
              a compatibilidade das   atividades desenvolvidas com os objetivos do curso em que o aluno estiver   matriculado; <br />
              a qualidade na realiza&ccedil;&atilde;o das atividades;<br />
              o total de horas   dedicadas &agrave; atividade.<br />
&sect;.1&ordm;. Somente ser&atilde;o consideradas, para efeito de   pontua&ccedil;&atilde;o em Atividades Complementares, a participa&ccedil;&atilde;o em atividades   desenvolvidas ap&oacute;s a data de ingresso do aluno no ciclo em que estiver   matriculado.<br />
&sect;.2&ordm;. Em caso de mudan&ccedil;a de curso haver&aacute; reavalia&ccedil;&atilde;o das   atividades consideradas para a pontua&ccedil;&atilde;o em Atividades Complementares conforme   inciso I deste artigo 8&ordm;.<br />
&sect;.3&ordm;. A pontua&ccedil;&atilde;o adquirida no 1&ordm;. Ciclo em   Atividades Complementares n&atilde;o tem efeito cumulativo para o 2&ordm;. Ciclo.<br />
Art.9&ordm;.   Caber&aacute; ao aluno participar de atividades complementares que privilegiem a   constru&ccedil;&atilde;o de comportamentos sociais humanos e profissionais adicionais &agrave;s   atividades acad&ecirc;micas tradicionais, devendo integralizar 70 (setenta) pontos, no   m&iacute;nimo, relativos &agrave; sua participa&ccedil;&atilde;o ao longo de cada ciclo nos seguintes grupos   de atividades:<br />
              Atividades Esportivas;<br />
              Atividades Art&iacute;sticas e   Culturais;<br />
              Atividades Sociais e Pol&iacute;ticas (beneficentes ou   comunit&aacute;rias);<br />
              Cursos Extraordin&aacute;rios (como ouvinte);<br />
              Eventos   T&eacute;cnico-cient&iacute;ficos (palestras, congressos e semin&aacute;rios como ouvinte);<br />
              Cursos   de L&iacute;ngua Estrangeira Moderna;<br />
              Cursos Extraordin&aacute;rios, Eventos   T&eacute;cnico-cient&iacute;ficos (como professor/apresentador);<br />
              Artigos e/ou Projetos de   Inicia&ccedil;&atilde;o Cient&iacute;fica e Tecnol&oacute;gica;<br />
              Exposi&ccedil;&otilde;es   T&eacute;cnico-cient&iacute;ficas;<br />
              Est&aacute;gios Opcionais e/ou Est&aacute;gios Acad&ecirc;micos;<br />
              Visitas   T&eacute;cnicas.</p>
            <p align="justify" class="textoPreto">&sect; 1&ordm;. A cada grupo de atividades previstas nos incisos   do caput deste artigo poder&atilde;o ser atribu&iacute;dos no m&aacute;ximo 30 (trinta) pontos.<br />
&sect;   2&ordm;. Os est&aacute;gios previstos no item X deste artigo refere-se a est&aacute;gios de   caracter&iacute;stica opcional por parte do discente. O Est&aacute;gio Curricular Obrigat&oacute;rio   n&atilde;o poder&aacute; ser pontuado em Atividades Complementares, por j&aacute; possuir cr&eacute;dito de   carga hor&aacute;ria e registro de nota pr&oacute;prios.<br />
              <br />
              CAP&Iacute;TULO VI - DA PONTUA&Ccedil;&Atilde;O DOS   GRUPOS</p>
            <p align="justify" class="textoPreto">Art.10 As Atividades Complementares ser&atilde;o avaliadas,   segundo o crit&eacute;rio de carga hor&aacute;ria ou por participa&ccedil;&atilde;o efetiva nas atividades   constantes no artigo 9&ordm;. deste Regulamento, segundo a pontua&ccedil;&atilde;o abaixo:<br />
  Grupo   I ser&atilde;o atribu&iacute;dos at&eacute; 10 pontos por semestre por participa&ccedil;&atilde;o nas atividades   esportivas tais como: esportes individuais, nata&ccedil;&atilde;o, muscula&ccedil;&atilde;o, dan&ccedil;a e outras,   e esportes coletivos como basquetebol, handebol, voleibol, futsal e outros, em   Institui&ccedil;&otilde;es de acordo com o Art.3&ordm;. deste Regulamento.<br />
  Grupo II ser&atilde;o   atribu&iacute;dos at&eacute; 10 pontos por semestre por participa&ccedil;&atilde;o nas atividades art&iacute;sticas   e culturais tais como: banda marcial, camerata de sopro, teatro, coral,   radio-amadorismo e outras em Institui&ccedil;&otilde;es de acordo com o Art. 3&ordm;. deste   Regulamento.<br />
  Grupo III ser&atilde;o atribu&iacute;dos at&eacute; 10 pontos por participa&ccedil;&atilde;o   efetiva; em Diret&oacute;rios Acad&ecirc;micos, Entidades de Classe, Pastorais, Trabalho   Volunt&aacute;rio, Atividades Comunit&aacute;rias, CIPAS, Associa&ccedil;&otilde;es de Bairros e Brigadas de   Inc&ecirc;ndio.<br />
  Grupo IV ser&aacute; atribu&iacute;do 1 ponto por hora por participa&ccedil;&atilde;o em   minicursos e cursos da &aacute;rea espec&iacute;fica de cada curso superior de tecnologia e de   fundamento cient&iacute;fico ou de gest&atilde;o.<br />
  Grupo V ser&aacute; atribu&iacute;do 1 ponto por hora   pela participa&ccedil;&atilde;o em palestras t&eacute;cnicas, congressos e semin&aacute;rios.<br />
  Grupo VI   ser&atilde;o atribu&iacute;dos at&eacute; 10 pontos por semestre para o aluno que obtiver freq&uuml;&ecirc;ncia   e aprova&ccedil;&atilde;o em cursos de l&iacute;ngua estrangeira, internos ou externos &agrave;   Institui&ccedil;&atilde;o.<br />
  Grupo VII ser&atilde;o atribu&iacute;dos at&eacute; 5 pontos, por hora, por   apresenta&ccedil;&atilde;o de palestras t&eacute;cnicas, semin&aacute;rios, minicursos, cursos da &aacute;rea   espec&iacute;fica, de cada Curso Superior de Tecnologia.<br />
  Grupo VIII ser&atilde;o atribu&iacute;dos   at&eacute; 10 pontos a artigos publicados e at&eacute; 30 pontos a Projeto de Inicia&ccedil;&atilde;o   Cient&iacute;fica e Tecnol&oacute;gica, relacionados com o objetivo do Curso.<br />
  Grupo IX   ser&atilde;o atribu&iacute;dos at&eacute; 20 pontos para cada participa&ccedil;&atilde;o como expositor em   exposi&ccedil;&atilde;o t&eacute;cnica.<br />
  Grupo X ser&aacute; atribu&iacute;do 0,5 ponto por hora de est&aacute;gio e/ou   trabalho profissional na &aacute;rea do curso.<br />
  Grupo XI ser&atilde;o atribu&iacute;dos 5 pontos   por visita t&eacute;cnica.<br />
  Art. 11. A pontua&ccedil;&atilde;o atingida pelo aluno ser&aacute; convertida   em nota no intervalo de 0,0 a 10,0, com apenas um algarismo significativo para   efeito de registro acad&ecirc;mico.</p>
            <p align="justify"><span class="textoPreto">CAP&Iacute;TULO VII - DAS DISPOSI&Ccedil;&Otilde;ES GERAIS<br />
              <br />
              Art.   12. Os casos omissos nesse Regulamento ser&atilde;o resolvidos pela Coordena&ccedil;&atilde;o de   Curso.</span><br />
              <br />
              <span class="textoPreto"><a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a></span><br />
              <br />
          </p></td>
        </tr>
        

        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo">Est&aacute;gio Supervisionado<a name="estagio_supervisionado" id="estagio_supervisionado"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><p align="justify" class="textoPreto"><br />
            REGULAMENTO DA DISCIPLINA EST&Aacute;GIO CURRICULAR   SUPERVISIONADO DOS CURSOS SUPERIORESDE GRADUA&Ccedil;&Atilde;O DO CEFET-PR</p>
            <p align="justify" class="textoPreto">Cap&iacute;tulo I - DO EST&Aacute;GIO E SUAS FINALIDADES<br />
              <br />
              Art.   1&ordm; - O Est&aacute;gio Curricular, baseado na lei n&ordm; 6.494, de 07/12/77, regulamentado   pelo Decreto n&ordm; 87.497, de 18/08/82, no disposto nos Artigos 103 e 104 do   Regimento Geral do CEFET-PR, obedecer&aacute; &agrave;s presentes normas.<br />
              Art. 2&ordm;- O   Est&aacute;gio Supervisionado nos cursos Superiores de Gradua&ccedil;&atilde;o tem por   finalidade:<br />
              a) complementa&ccedil;&atilde;o do ensino e da aprendizagem;<br />
              b) adapta&ccedil;&atilde;o   psicol&oacute;gica e social do estudante &agrave; sua futura atividade profissional;<br />
              c)   treinamento do estudante para facilitar sua futura absor&ccedil;&atilde;o pelo mercado de   trabalho;<br />
              d) orienta&ccedil;&atilde;o do estudante na escolha de sua especializa&ccedil;&atilde;o   profissional.<br />
              Art. 3&ordm; - Est&aacute;gio Supervisionado &eacute; uma disciplina obrigat&oacute;ria   dos Cursos Superiores de Gradua&ccedil;&atilde;o ministrados pelo CEFET-PR.</p>
            <p align="justify" class="textoPreto">Cap&iacute;tulo II - DA FORMA DE REALIZA&Ccedil;&Atilde;O<br />
              <br />
              Art. 4&ordm; -   Caber&aacute; ao CEFET-PR, atrav&eacute;s da Ger&ecirc;ncia de Rela&ccedil;&otilde;es Empresariais e Comunit&aacute;rias   e Ger&ecirc;ncia de Ensino e Pesquisa, prover meios necess&aacute;rios &agrave; obten&ccedil;&atilde;o e ao   desenvolvimento pedag&oacute;gico do est&aacute;gio.<br />
              Art. 5&ordm; - O Est&aacute;gio dever&aacute; ser   realizado em empresas ou institui&ccedil;&otilde;es p&uacute;blicas ou privadas, devidamente   credenciadas com o CEFET-PR, e que apresentem condi&ccedil;&otilde;es de proporcionar   experi&ecirc;ncias na &aacute;rea de forma&ccedil;&atilde;o do aluno.<br />
              Art. 6&ordm; - A participa&ccedil;&atilde;o do aluno   em projetos de interesse para a Institui&ccedil;&atilde;o ou sociedade, proposta pela   Coordena&ccedil;&atilde;o do Curso poder&aacute; ser considerada como Est&aacute;gio.<br />
              Art. 7&ordm; - O Est&aacute;gio   ser&aacute; precedido da celebra&ccedil;&atilde;o do Termo de Compromisso entre o estudante e a   empresa com a interveni&ecirc;ncia do CEFET-PR, atrav&eacute;s Ger&ecirc;ncia de Rela&ccedil;&otilde;es   Empresariais e Comunit&aacute;rias, exceto nos casos previstos no artigo 6&ordm;.<br />
              Art. 8&ordm;   - O CEFET-PR providenciar&aacute; um seguro de acidentes pessoais para cada aluno   estagi&aacute;rio, caso a empresa n&atilde;o o fa&ccedil;a.<br />
              Art. 9&ordm; - Os alunos que exercerem   atividades profissionais em &aacute;reas correlatas a seu curso na condi&ccedil;&atilde;o de   empregados devidamente registrados, aut&ocirc;nomos ou empres&aacute;rios poder&atilde;o considerar   tais atividades como est&aacute;gio.<br />
&sect; 1&ordm; - A aceita&ccedil;&atilde;o do exerc&iacute;cio de atividades   profissionais a que se refere o caput deste artigo, como est&aacute;gio, depender&aacute; de   decis&atilde;o do Coordenador do Curso respectivo que levar&aacute; em considera&ccedil;&atilde;o o tipo de   atividade desenvolvida e o valor de sua contribui&ccedil;&atilde;o para complementar a   forma&ccedil;&atilde;o profissional.<br />
&sect; 2&ordm; - Ao requerer o aproveitamento como est&aacute;gio de   suas atividades profissionais, o aluno dever&aacute; apresentar os seguintes   documentos:<br />
I. se empregado, c&oacute;pia da parte da Carteira de Trabalho em que   fique configurado seu v&iacute;nculo empregat&iacute;cio e descri&ccedil;&atilde;o, por parte de seu chefe   imediato, das atividades que desenvolve;<br />
II. se aut&ocirc;nomo, comprovante de seu   registro na Prefeitura Municipal nessa condi&ccedil;&atilde;o, comprovante de recolhimento do   Imposto sobre Servi&ccedil;os correspondente ao m&ecirc;s da entrada do requerimento e   descri&ccedil;&atilde;o das atividades que executa;<br />
III. se empres&aacute;rio, c&oacute;pia do Contrato   Social da empresa e descri&ccedil;&atilde;o das atividades que executa.<br />
Art. 10&ordm; - O   Est&aacute;gio n&atilde;o acarretar&aacute; v&iacute;nculo empregat&iacute;cio de qualquer natureza.<br />
Art. 11 - A   carga hor&aacute;ria referente &agrave; disciplina Est&aacute;gio n&atilde;o ser&aacute; computada para efeito da   carga hor&aacute;ria semanal m&aacute;xima permitida para o aluno.</p>
            <p align="justify" class="textoPreto">Cap&iacute;tulo III - DA MATR&Iacute;CULA NA DISCIPLINA</p>
            <p align="justify" class="textoPreto">Art. 12 - A matr&iacute;cula na disciplina Est&aacute;gio ocorrer&aacute; de   acordo com as regras estabelecidas nos curr&iacute;culos de cada curso.<br />
  Art. 13 - A   matr&iacute;cula na disciplina Est&aacute;gio ter&aacute; validade at&eacute; o momento em que o aluno tenha   sido avaliado, nos termos do Cap&iacute;tulo VI deste Regulamento, e tenha participado   do Semin&aacute;rio de Est&aacute;gio.</p>
            <p align="justify" class="textoPreto">Cap&iacute;tulo IV - DA DURA&Ccedil;&Atilde;O DO EST&Aacute;GIO</p>
            <p align="justify" class="textoPreto">Art. 14 - O Est&aacute;gio ter&aacute; dura&ccedil;&atilde;o m&iacute;nima conforme   previsto no curr&iacute;culo do curso, atendida a legisla&ccedil;&atilde;o vigente.<br />
  Art. 15 - O   Est&aacute;gio poder&aacute; ser desenvolvido em mais de uma empresa, desde que autorizado   pelo Coordenador de Curso..Art. 16 - A complementa&ccedil;&atilde;o do est&aacute;gio na mesma   empresa ou em outra, ap&oacute;s sua interrup&ccedil;&atilde;o, somente poder&aacute; ocorrer ap&oacute;s aprova&ccedil;&atilde;o   de novo Plano de Est&aacute;gio e assinatura de novo Termo de Compromisso.<br />
  Art. 17 -   O tempo previsto para o Est&aacute;gio passar&aacute; a ser contado a partir da aprova&ccedil;&atilde;o pelo   Coordenador do Curso do Plano de Est&aacute;gio, elaborado em conson&acirc;ncia com o   Supervisor de Est&aacute;gio e analisado pelo Professor-Orientador.<br />
  Art. 18 - O   aluno que deixar de cumprir as atividades de Est&aacute;gio nas datas previstas no   Calend&aacute;rio Escolar e nas divulgadas em Edital pela Coordena&ccedil;&atilde;o de Curso perder&aacute;   o direito de conclus&atilde;o de seu Est&aacute;gio naquele per&iacute;odo letivo.</p>
            <p align="justify" class="textoPreto">Cap&iacute;tulo V - DO DESLIGAMENTO DO EST&Aacute;GIO<br />
              <br />
              Art. 19 -   O desligamento do estagi&aacute;rio ocorrer&aacute; automaticamente ao t&eacute;rmino do   contrato.<br />
              Art. 20 - O estagi&aacute;rio poder&aacute; ser desligado da empresa antes do   encerramento do per&iacute;odo previsto, nos seguintes casos:<br />
              a) a pedido do   estagi&aacute;rio com pr&eacute;via aquiesc&ecirc;ncia do Coordenador do Curso, com comunica&ccedil;&atilde;o &agrave;   empresa e &agrave; Ger&ecirc;ncia de Rela&ccedil;&otilde;es Empresariais e Comunit&aacute;rias;<br />
              b) por   iniciativa da empresa.</p>
            <p align="justify" class="textoPreto">Cap&iacute;tulo VI - DO ACOMPANHAMENTO E AVALIA&Ccedil;&Atilde;O DO   EST&Aacute;GIO<br />
              <br />
              Art. 21 - O acompanhamento de est&aacute;gio ser&aacute; feito pelo Professor   Orientador atrav&eacute;s de:<br />
              a) reuni&otilde;es de acompanhamento entre Professor   Orientador e aluno durante o per&iacute;odo de est&aacute;gio;<br />
              b) visitas &agrave;s empresas em   que est&atilde;o sendo realizados os est&aacute;gios;<br />
              c) relat&oacute;rios parciais elaborados   pelo estagi&aacute;rio.<br />
              Art.22 - A avalia&ccedil;&atilde;o de est&aacute;gio ser&aacute; realizada pelo   Coordenador do Curso, levando-se em conta pelo menos os seguintes itens:<br />
              a)   avalia&ccedil;&atilde;o do Supervisor de Est&aacute;gio;<br />
              b) avalia&ccedil;&atilde;o do Professor Orientador de   Est&aacute;gio;<br />
              c) relat&oacute;rio final;<br />
              d) semin&aacute;rio de est&aacute;gio.<br />
              Par&aacute;grafo &Uacute;nico -   Ser&aacute; considerado aprovado o aluno que obtiver nota final igual ou superior a 5,0   (cinco).Art. 23 - O Relat&oacute;rio Final ser&aacute; avaliado com base nos seguintes   aspectos:<br />
              a) compatibilidade do trabalho executado com plano de   est&aacute;gio;<br />
              b) qualidade do trabalho e apresenta&ccedil;&atilde;o do relat&oacute;rio;<br />
              c)   capacidade criativa e inovadora demonstrada atrav&eacute;s do trabalho.<br />
              Art. 24 - O   Relat&oacute;rio Final dever&aacute; ser elaborado de acordo com as recomenda&ccedil;&otilde;es contidas nas   Normas vigentes da ABNT.<br />
              Art. 25 - A data limite para entrega dos relat&oacute;rios   ser&aacute; sempre o s&eacute;timo dia &uacute;til antes da data prevista para realiza&ccedil;&atilde;o do   Semin&aacute;rio de Est&aacute;gio.<br />
              <br />
              Cap&iacute;tulo VII - DAS ATRIBUI&Ccedil;&Otilde;ES DAS   PARTES<br />
              <br />
              Se&ccedil;&atilde;o I - DAS ATRIBUI&Ccedil;&Otilde;ES DA GER&Ecirc;NCIA DE RELA&Ccedil;&Otilde;ES EMPRESARIAIS E   COMUNIT&Aacute;RIAS.<br />
              <br />
              Art. 26 - Compete &agrave; Ger&ecirc;ncia de Rela&ccedil;&otilde;es Empresariais e   Comunit&aacute;rias:<br />
              a) identificar as oportunidades de est&aacute;gios junto &agrave;s   empresas;<br />
              b) prestar servi&ccedil;os administrativos de cadastramento de estudantes   e levantamento das &aacute;reas mais indicadas para est&aacute;gio e das ofertas   existentes;<br />
              c) proceder ao encaminhamento &agrave;s empresas dos alunos candidatos a   est&aacute;gio;<br />
              d) fornecer ao estagi&aacute;rio o formul&aacute;rio de Plano de Est&aacute;gio;<br />
              e)   fornecer carta de apresenta&ccedil;&atilde;o para os alunos, quando solicitada;<br />
              f) celebrar   conv&ecirc;nios com as empresas concessoras de est&aacute;gios;<br />
              g) providenciar o seguro   de acidentes pessoais em favor do estagi&aacute;rio, quando a empresa n&atilde;o o   fizer;<br />
              h) atuar, como interveniente, no ato da celebra&ccedil;&atilde;o do &quot;Termo de   Compromisso&quot; entre a empresa e o estagi&aacute;rio;<br />
              i) fornecer ao estagi&aacute;rio   informa&ccedil;&otilde;es sobre os aspectos legais e administrativos a respeito das atividades   de est&aacute;gio.</p>
            <p align="justify" class="textoPreto">Se&ccedil;&atilde;o II - DAS ATRIBUI&Ccedil;&Otilde;ES DA COORDENA&Ccedil;&Atilde;O DE   CURSO<br />
              <br />
              Art. 27 - Incumbe ao Coordenador de Curso:<br />
              a) proporcionar aos   professores orientadores hor&aacute;rios para atendimento &agrave;s atividades de   est&aacute;gio;<br />
              b) homologar o nome do Professor Orientador de Est&aacute;gio;<br />
              c)   aprovar o Plano de Est&aacute;gio do aluno;<br />
              d) promover a substitui&ccedil;&atilde;o do Professor   Orientador, quando do seu impedimento;<br />
              e) coordenar o semin&aacute;rio de   est&aacute;gio;.f) realizar a avalia&ccedil;&atilde;o final, efetuar o lan&ccedil;amento das notas finais do   est&aacute;gio e encaminh&aacute;-las &agrave; secretaria;<br />
              g) indicar, quando necess&aacute;rio e tendo   em vista as caracter&iacute;sticas de cada Curso e Regi&atilde;o onde vierem a se realizar os   est&aacute;gios, um Professor ou comiss&atilde;o para auxilio no acompanhamento do processo do   Est&aacute;gio (Professor Auxiliar/Comiss&atilde;o de Coordena&ccedil;&atilde;o de Est&aacute;gio).<br />
              <br />
              Se&ccedil;&atilde;o   III - DAS ATRIBUI&Ccedil;&Otilde;ES DO PROFESSOR ORIENTADOR<br />
              <br />
              Art. 28 - Incumbe ao   Professor Orientador :<br />
              a) orientar o aluno na elabora&ccedil;&atilde;o do Plano de Est&aacute;gio,   durante o per&iacute;odo de est&aacute;gio e na elabora&ccedil;&atilde;o do Relat&oacute;rio Final;<br />
              b) proceder   ao acompanhamento do est&aacute;gio conforme disposto no cap&iacute;tulo VI;<br />
              c) efetuar a   avalia&ccedil;&atilde;o do relat&oacute;rio e emitir nota;<br />
              d) contribuir para a integra&ccedil;&atilde;o   CEFET-PR e a empresa;<br />
              e) realizar visitas &agrave;s empresas em que o aluno esteja   estagiando;<br />
              f) participar das reuni&otilde;es com Coordenador do Curso e/ou   Professor Auxiliar/Comiss&atilde;o de acompanhamento de est&aacute;gio;<br />
              g) participar do   semin&aacute;rio de est&aacute;gio quando solicitado pelo Coordenador.<br />
              h) Assumir as   fun&ccedil;&otilde;es de Supervisor de Est&aacute;gio, na falta deste.<br />
              <br />
              Se&ccedil;&atilde;o IV - DAS   ATRIBUI&Ccedil;&Otilde;ES DA EMPRESA CONCESSORA DO EST&Aacute;GIO</p>
            <p align="justify" class="textoPreto">Art. 29 - Segundo a Lei 6.494, de 07/12/77,   regulamentada pelo Decreto 87.497, de<br />
  18/08/82, caber&aacute; &agrave; empresa concessora   do est&aacute;gio:<br />
  a) celebrar com o CEFET-PR conv&ecirc;nio para est&aacute;gio;<br />
  b) firmar   com o estagi&aacute;rio o Termo de Compromisso;<br />
  c) promover a sele&ccedil;&atilde;o dos candidatos   a est&aacute;gio;<br />
  d) informar ao estagi&aacute;rio as normas da empresa;<br />
  e) efetuar o   pagamento de bolsa est&aacute;gio quando houver previs&atilde;o nesse sentido;<br />
  f) designar   um Supervisor com vista a dar orienta&ccedil;&atilde;o ao estagi&aacute;rio;<br />
  g) assinar Carteira   Profissional do estagi&aacute;rio;<br />
  h) comunicar ao CEFET-PR quaisquer altera&ccedil;&otilde;es no   Termo de Compromisso firmado com o estagi&aacute;rio.</p>
            <p align="justify" class="textoPreto">Se&ccedil;&atilde;o V - DAS ATRIBUI&Ccedil;&Otilde;ES DO SUPERVISOR DE   EST&Aacute;GIO<br />
              <br />
              Art. 30 - Incumbe ao Supervisor de Est&aacute;gio:<br />
              a) promover a   integra&ccedil;&atilde;o do estagi&aacute;rio com a situa&ccedil;&atilde;o de est&aacute;gio;<br />
              b) ajudar o estagi&aacute;rio na   elabora&ccedil;&atilde;o do Plano de Est&aacute;gio;<br />
              c) proceder &agrave; avalia&ccedil;&atilde;o de desempenho do   estagi&aacute;rio em conjunto com o Professor Orientador e/ou Professor   Auxiliar/Comiss&atilde;o de acompanhamento de est&aacute;gio;<br />
              d) orientar o estagi&aacute;rio   durante o per&iacute;odo de est&aacute;gio.</p>
            <p align="justify" class="textoPreto">Se&ccedil;&atilde;o VI - DAS ATRIBUI&Ccedil;&Otilde;ES DO   PROFESSOR-AUXILIAR/COMISS&Atilde;O DE COORDENA&Ccedil;&Atilde;O DE EST&Aacute;GIO<br />
              <br />
              Art. 31 - Incumbe   ao Professor Auxiliar ou Comiss&atilde;o de coordena&ccedil;&atilde;o de est&aacute;gio:<br />
              a) apoiar o   Coordenador de Curso no desenvolvimento das atividades relativas a   est&aacute;gios;<br />
              b) promover reuni&otilde;es de orienta&ccedil;&atilde;o com alunos estagi&aacute;rios e   Professores Orientadores;<br />
              c) realizar visitas &agrave;s empresas com o objetivo de   melhor acompanhar o estagi&aacute;rio e subsidiar os Professores Orientadores, quando   do impedimento destes;<br />
              d) definir juntamente com a Coordena&ccedil;&atilde;o de Curso e   divulgar datas limite para entrega de relat&oacute;rios e planos de atividades;<br />
              e)   participar, juntamente com o setor encarregado da administra&ccedil;&atilde;o do Programa de   Est&aacute;gio na Institui&ccedil;&atilde;o, de visitas t&eacute;cnicas a empresas, quando do impedimento do   Coordenador do Curso;<br />
              f) acompanhar a realiza&ccedil;&atilde;o do Semin&aacute;rio de Est&aacute;gio.</p>
            <p align="justify"><span class="textoPreto">Cap&iacute;tulo VIII - DAS DISPOSI&Ccedil;&Otilde;ES GERAIS<br />
              <br />
              Art. 32 -   As especificidades de cada Curso n&atilde;o contempladas neste Regulamento de Est&aacute;gio   Supervisionado ter&atilde;o normatiza&ccedil;&atilde;o pr&oacute;pria previsto em curr&iacute;culo ou aprovada pela   Diretoria de Ensino na Unidade de Curitiba ou pelo Diretor das demais   Unidades.<br />
              Art. 33 - Os casos omissos neste Regulamento ser&atilde;o resolvidos pela   Diretoria de Ensino/Ger&ecirc;ncia de Ensino e Pesquisa do CEFET-PR.</span><br />
              <br />
              <span class="textoPreto"><a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a></span><br />
              <br />
          </p></td>
        </tr>
        

        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo">Trabalho de Diploma&ccedil;&atilde;o<a name="trabalho_diplomacao" id="trabalho_diplomacao"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><p align="justify" class="textoPreto"><br />
            REGULAMENTO PARA O TRABALHO DE DIPLOMA&Ccedil;&Atilde;O DOS CURSOS SUPERIORES DE TECNOLOGIA DO CEFET-PR</p>
            <p align="justify" class="textoPreto">DOS OBJETIVOS E CARACTER&Iacute;STICAS</p>
            <p align="justify" class="textoPreto">Art. 1&ordm; - O Trabalho de Diploma&ccedil;&atilde;o &eacute; disciplina obrigat&oacute;ria dos curr&iacute;culos dos cursos de Tecnologia do CEFET-PR, e tem como objetivos principais:<br />
  Desenvolver a capacidade de aplica&ccedil;&atilde;o dos conceitos e teorias adquiridas durante o curso de forma integrada atrav&eacute;s da execu&ccedil;&atilde;o de um projeto;<br />
  Desenvolver a capacidade de planejamento e disciplina para resolver problemas dentro das &aacute;reas de forma&ccedil;&atilde;o espec&iacute;fica;<br />
  Despertar o interesse pela pesquisa como meio para a resolu&ccedil;&atilde;o de problemas;<br />
  Estimular o esp&iacute;rito empreendedor atrav&eacute;s da execu&ccedil;&atilde;o de projetos que levem ao desenvolvimento de produtos e processos que possam ser patenteados e/ou comercializados;<br />
  Intensificar a extens&atilde;o universit&aacute;ria atrav&eacute;s da resolu&ccedil;&atilde;o de problemas existentes no setor produtivo e na sociedade;<br />
  Estimular a constru&ccedil;&atilde;o do conhecimento coletivo.<br />
  Art. 2&ordm; - O Trabalho de Diploma&ccedil;&atilde;o poder&aacute; ser desenvolvido individualmente ou em equipes de at&eacute; 3 (tr&ecirc;s) alunos, inclusive de cursos distintos.<br />
&sect; &Uacute;nico - Deve-se evitar trabalhos apenas te&oacute;ricos bem como meros relatos de aspectos pr&aacute;ticos ou de observa&ccedil;&otilde;es acumuladas.</p>
            <p align="justify" class="textoPreto">DA MATR&Iacute;CULA E ACOMPANHAMENTO</p>
            <p align="justify" class="textoPreto">Art. 3&ordm; - A matr&iacute;cula na disciplina de Trabalho de Diploma&ccedil;&atilde;o ser&aacute; efetuada de acordo com os procedimentos publicados a cada per&iacute;odo letivo pela Ger&ecirc;ncia de Ensino e Pesquisa de cada Unidade.<br />
&sect; 1&ordm; - Os alunos poder&atilde;o matricular-se na disciplina de Trabalho de Diploma&ccedil;&atilde;o a partir do per&iacute;odo previsto no Regulamento da Organiza&ccedil;&atilde;o Did&aacute;tico-pedag&oacute;gica dos Cursos Superiores de Tecnologia do Sistema CEFET-PR, apresentando a aprova&ccedil;&atilde;o de sua proposta, conforme artigo 5&ordm; deste regulamento.<br />
&sect; 2&ordm; - O per&iacute;odo de matr&iacute;cula no trabalho de diploma&ccedil;&atilde;o vigorar&aacute; a partir da data de matr&iacute;cula de seu curso constada em calend&aacute;rio at&eacute; no m&aacute;ximo 5 (cinco) dias ap&oacute;s a divulga&ccedil;&atilde;o da aprova&ccedil;&atilde;o das propostas em &uacute;ltima inst&acirc;ncia (conforme art. 8o, &sect; 4).<br />
Art. 4&ordm; - O acompanhamento dos alunos no Trabalho de Diploma&ccedil;&atilde;o ser&aacute; feito por um professor orientador escolhido pelo aluno ou designado pelo professor respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o, observando-se sempre a vincula&ccedil;&atilde;o entre a &aacute;rea de conhecimento em que ser&aacute; desenvolvido o projeto e a &aacute;rea de atua&ccedil;&atilde;o do professor orientador.<br />
&sect; 1&ordm; - Se houver necessidade, poder&aacute; existir a figura do co-orientador, para auxiliar nos trabalhos de orienta&ccedil;&atilde;o e/ou aqueles que o orientador indicar, desde que aprovados pelo coordenador de curso.</p>
            <p align="justify" class="textoPreto">&sect; 2&ordm; - A mudan&ccedil;a de orientador dever&aacute; ser solicitada por escrito e aprovada pelo coordenador de curso e pelo professor respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o.<br />
&sect; 3&ordm; - O acompanhamento dos Trabalhos de Diploma&ccedil;&atilde;o ser&aacute; feito atrav&eacute;s de reuni&otilde;es peri&oacute;dicas, no m&iacute;nimo uma por m&ecirc;s, previamente agendadas entre orientador e orientado(s), devendo o cronograma ser apresentado ao professor respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o, at&eacute; vinte dias ap&oacute;s a aprova&ccedil;&atilde;o da proposta.<br />
&sect; 4&ordm; - Ap&oacute;s cada reuni&atilde;o de orienta&ccedil;&atilde;o dever&aacute; ser apresentado um relat&oacute;rio simplificado dos assuntos tratados na mesma, o qual dever&aacute; ser assinado pelos(s) aluno(s) e pelo orientador e arquivado na pasta de acompanhamento do Trabalho de Diploma&ccedil;&atilde;o.<br />
&sect; 5&ordm; - &Eacute; obrigat&oacute;ria a participa&ccedil;&atilde;o do(s) aluno(s) em pelo menos 75% das reuni&otilde;es de orienta&ccedil;&atilde;o.</p>
            <p align="justify" class="textoPreto">DA APRESENTA&Ccedil;&Atilde;O DA PROPOSTA</p>
            <p align="justify" class="textoPreto">Art 5&ordm; - O tema para o Trabalho de Diploma&ccedil;&atilde;o deve estar inserido em um dos campos de atua&ccedil;&atilde;o do curso do aluno, prioritariamente em sua modalidade e dever&aacute; ser apresentado em semin&aacute;rio de avalia&ccedil;&atilde;o de propostas de Trabalho de Diploma&ccedil;&atilde;o.<br />
&sect; 1&ordm; - Os semin&aacute;rios de avalia&ccedil;&atilde;o de proposta de Trabalho de Diploma&ccedil;&atilde;o ser&atilde;o realizados no in&iacute;cio e no final de cada semestre letivo, pelas respectivas coordena&ccedil;&otilde;es de curso, que emitir&atilde;o um documento de aprova&ccedil;&atilde;o das propostas.<br />
&sect; 2&ordm; - A n&atilde;o apresenta&ccedil;&atilde;o da proposta de Trabalho de Diploma&ccedil;&atilde;o em semin&aacute;rio de avalia&ccedil;&atilde;o implicar&aacute; na impossibilidade de matr&iacute;cula na disciplina de Trabalho de Diploma&ccedil;&atilde;o.<br />
Art. 6o - Para participar do semin&aacute;rio do in&iacute;cio do semestre, que ser&aacute; realizado nos primeiros trintas dias do per&iacute;odo letivo, o aluno dever&aacute; inscrever-se junto &agrave; coordena&ccedil;&atilde;o at&eacute; o 10&ordm; dia ap&oacute;s iniciado o semestre.<br />
Art. 7o - Para participar do semin&aacute;rio no final do semestre, que ser&aacute; realizado nos &uacute;ltimos trinta dias do per&iacute;odo letivo, o aluno dever&aacute; inscrever-se junto &agrave; coordena&ccedil;&atilde;o pelo menos 30 dias antes do final do semestre.<br />
Art. 8&ordm; - A avalia&ccedil;&atilde;o da proposta de Trabalho de Diploma&ccedil;&atilde;o ser&aacute; feita por uma banca composta pelo orientador do trabalho, um professor indicado pela coordena&ccedil;&atilde;o de curso, o professor respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o e/ou coordenador de curso, no m&iacute;nimo.<br />
&sect; 1&ordm; - As propostas de Trabalho de Diploma&ccedil;&atilde;o ser&atilde;o avaliadas com base nos seguintes crit&eacute;rios:<br />
Valor acad&ecirc;mico, inova&ccedil;&otilde;es apresentadas ou utilidade pr&aacute;tica do projeto;<br />
Cronograma de execu&ccedil;&atilde;o;<br />
Custos, condi&ccedil;&otilde;es e materiais dispon&iacute;veis.<br />
&sect; 2&ordm; - O resultado das avalia&ccedil;&otilde;es das propostas ser&aacute; divulgado, em edital da coordena&ccedil;&atilde;o de curso, 7 (sete) dias ap&oacute;s a realiza&ccedil;&atilde;o do semin&aacute;rio.</p>
            <p align="justify" class="textoPreto">&sect; 3&ordm; - O(s) aluno(s) cuja proposta n&atilde;o for aprovada no semin&aacute;rio do final do semestre letivo poder&aacute;(&atilde;o) reapresent&aacute;-la no semin&aacute;rio subsequente.<br />
&sect; 4&ordm; - O(s) aluno(s) cuja proposta n&atilde;o for aprovada no semin&aacute;rio do in&iacute;cio do semestre letivo ter&aacute;(&atilde;o) um prazo adicional de 15 (quinze) dias ap&oacute;s a divulga&ccedil;&atilde;o do resultado para reapresent&aacute;-la.</p>
            <p align="justify" class="textoPreto">&sect; 5&ordm; - O cronograma de execu&ccedil;&atilde;o, incluindo a defesa, n&atilde;o poder&aacute; ser superior ao prazo m&aacute;ximo de conclus&atilde;o do curso ou doze meses, a contar da data da divulga&ccedil;&atilde;o do resultado da avalia&ccedil;&atilde;o da proposta do semin&aacute;rio, realizado no in&iacute;cio de cada semestre.</p>
            <p align="justify" class="textoPreto">DA DEFESA</p>
            <p align="justify" class="textoPreto">Art. 9&ordm; - A defesa do Trabalho de Diploma&ccedil;&atilde;o ser&aacute; realizada em evento espec&iacute;fico, cuja data, hor&aacute;rio e local ser&atilde;o informados em edital com pelo menos 30 dias de anteced&ecirc;ncia.<br />
&sect; &Uacute;nico - &Eacute; fun&ccedil;&atilde;o do coordenador de curso e professor respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o definir locais, datas e hor&aacute;rios para realiza&ccedil;&atilde;o do Evento de Avalia&ccedil;&atilde;o de Trabalho de Diploma&ccedil;&atilde;o.<br />
Art. 10&ordm; - A banca de defesa do Trabalho de Diploma&ccedil;&atilde;o ser&aacute; composta por, no m&iacute;nimo, o orientador do trabalho, um professor e mais uma pessoa de &aacute;rea afim indicados pelo orientador.<br />
Art. 11&ordm; - Para participar da defesa do Trabalho de Diploma&ccedil;&atilde;o o aluno dever&aacute; inscrever-se, junto a DIRAC (Divis&atilde;o de Registros Acad&ecirc;micos) de sua unidade pelo menos 15 (quinze) dias antes da data prevista para o evento.<br />
Art. 12&ordm; - No ato da inscri&ccedil;&atilde;o para a defesa do Trabalho de Diploma&ccedil;&atilde;o, o aluno dever&aacute; entregar pelo menos 4 (quatro) c&oacute;pias do trabalho final e 1 (uma) c&oacute;pia do artigo cient&iacute;fico, devidamente rubricadas pelo seu orientador.<br />
&sect; &Uacute;nico - Na elabora&ccedil;&atilde;o do trabalho final devem ser seguidas as recomenda&ccedil;&otilde;es especificadas nas normas vigentes da ABNT.<br />
Art. 13&ordm; - Alunos reprovados na defesa dever&atilde;o apresentar nova proposta de projeto para avalia&ccedil;&atilde;o, conforme art. 5&ordm; e 8&ordm; deste regulamento.<br />
Art. 14&deg; - O trabalho que contemplar mais de um aluno dever&aacute; ser defendido individualmente, obedecendo &agrave; compet&ecirc;ncia de cada um no projeto, conforme apresentado para aprecia&ccedil;&atilde;o, no Semin&aacute;rio de Avalia&ccedil;&atilde;o de Propostas de Trabalho de Diploma&ccedil;&atilde;o.<br />
Art. 15&deg; - Ap&oacute;s 30 (trinta) dias da defesa do Trabalho de Diploma&ccedil;&atilde;o, o aluno dever&aacute; entregar 01 (uma) c&oacute;pia corrigida e encadernada ao orientador para encaminhamento &agrave; biblioteca.</p>
            <p align="justify" class="textoPreto">DAS ATRIBUI&Ccedil;&Otilde;ES DO COORDENADOR DE CURSO</p>
            <p align="justify" class="textoPreto">Art. 16&ordm; - Compete ao Coordenador de curso:<br />
  estabelecer aos professores orientadores hor&aacute;rios para atendimento &agrave;s atividades de Trabalho de Diploma&ccedil;&atilde;o;<br />
  homologar o nome do professor respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o e tamb&eacute;m do professor orientador;<br />
  promover a substitui&ccedil;&atilde;o do professor respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o, quando do impedimento deste;<br />
  participar dos semin&aacute;rios de an&aacute;lise de propostas de Trabalho de Diploma&ccedil;&atilde;o quando do impedimento do professor respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o.</p>
            <p align="justify" class="textoPreto">DAS ATRIBUI&Ccedil;&Otilde;ES DO PROFESSOR RESPONS&Aacute;VEL PELO TRABALHO DE DIPLOMA&Ccedil;&Atilde;O</p>
            <p align="justify" class="textoPreto">Art. 17&ordm; - Compete ao Professor Respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o:<br />
  apoiar o Coordenador de Curso no desenvolvimento das atividades relativas ao Trabalho de Diploma&ccedil;&atilde;o;<br />
  promover reuni&otilde;es de orienta&ccedil;&atilde;o com alunos e professores orientadores;<br />
  realizar visitas &agrave;s empresas com o objetivo de acompanhar o Trabalho de Diploma&ccedil;&atilde;o e substituir os professores orientadores, quando do impedimento destes;<br />
  definir, juntamente com a Coordena&ccedil;&atilde;o de Curso datas limites para entrega de projetos, relat&oacute;rios, marcar a data de defesa dos Trabalhos de Diploma&ccedil;&atilde;o e divulg&aacute;-las;<br />
  coordenar os semin&aacute;rios de an&aacute;lise de propostas de Trabalho de Diploma&ccedil;&atilde;o e chefiar a banca de defesa dos mesmos;<br />
  participar dos semin&aacute;rios de an&aacute;lise de propostas de Trabalho de Diploma&ccedil;&atilde;o;<br />
  promover a substitui&ccedil;&atilde;o do professor orientador, quando do impedimento deste;<br />
  efetuar o lan&ccedil;amento das notas finais do Trabalho de Diploma&ccedil;&atilde;o e encaminh&aacute;-las &agrave; DIRAC.</p>
            <p align="justify" class="textoPreto">DAS ATRIBUI&Ccedil;&Otilde;ES DO PROFESSOR ORIENTADOR</p>
            <p align="justify" class="textoPreto">Art. 18&ordm; - Compete ao Professor Orientador:<br />
  orientar o aluno na Elabora&ccedil;&atilde;o da proposta do Trabalho de Diploma&ccedil;&atilde;o bem como do trabalho final;<br />
  acompanhar o desenvolvimento do projeto, conforme disposto no art. 4&ordm;;<br />
  participar da banca examinadora do semin&aacute;rio de apresenta&ccedil;&atilde;o da proposta e da defesa do Trabalho de Diploma&ccedil;&atilde;o;<br />
  realizar visitas &agrave;s empresas em que o aluno esteja desenvolvendo o Trabalho de Diploma&ccedil;&atilde;o;<br />
  participar de reuni&otilde;es sobre os Trabalhos de Diploma&ccedil;&atilde;o com a Coordena&ccedil;&atilde;o de Curso e/ou com o Professor Respons&aacute;vel pelo Trabalho de Diploma&ccedil;&atilde;o.</p>
            <p align="justify" class="textoPreto">DAS ATRIBUI&Ccedil;&Otilde;ES DO ALUNO</p>
            <p align="justify" class="textoPreto">Art. 18&ordm; - Compete ao Aluno:<br />
  conduzir e executar o Trabalho de Diploma&ccedil;&atilde;o;<br />
              redigir e defender o trabalho final;<br />
              tomar ci&ecirc;ncia e cumprir os prazos estabelecidos pela Coordena&ccedil;&atilde;o de curso e Ger&ecirc;ncia de Ensino e Pesquisa.</p>
            <p align="justify" class="textoPreto">DAS DISPOSI&Ccedil;&Otilde;ES GERAIS<br />
  Art. 19&deg; - Os casos omissos neste regulamento ser&atilde;o resolvidos pela Ger&ecirc;ncia de Ensino e Pesquisa de cada Unidade.<br />
  <br />
  <a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a><br />
          <br />
          </p></td>
        </tr>
        
        <tr>
          <td height="20" colspan="2" align="left" valign="middle" bgcolor="#E4E1DC">&nbsp;<img src="../images/seta.gif" width="13" height="13" align="absmiddle"/>&nbsp;<span class="textoPretoTitulo">Professores<a name="professores" id="professores"></a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><span class="textoTurista"><br />
            {professores}<a href="link.php?acao=adicionar" class="linkPaginacao"><br />
            <span class="textoPreto"><a href="#topo"><img src="../images/setaCima.gif" width="13" height="13" border="0" /></a> <a href="#topo" class="linkPaginacao">Topo </a></span></td>
        </tr>
        <tr>
          <td height="40"></td>
          <td align="left" valign="middle"><div align="center" class="textoPreto">{voltar}</div></td>
        </tr>
  </table>    </td>
  </tr>
  <tr>
    <td height="25" align="center" valign="middle" class="textoInterna">&nbsp;</td>
  </tr>
</table>
<!-- END blk_sobre -->